dong4j/desk-gateway/firmware/desk-gateway/sdkconfig.defaults
# YD-ESP32-S3 N16R8：16MB Flash + Octal 8MB PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# YD-ESP32-S3 用板载 USB-C（USB Serial/JTAG）做控制台，才能在监视器里输入 wifi 等命令
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NimBLE 使固件超过默认 1 MiB factory 分区；使用 ESP-IDF 自带的 1500 KiB 单应用分区。
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 原生 BLE Peripheral：只启用 NimBLE GATT Server，并将配对信息持久化到 NVS。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# 保留 NimBLE 警告和错误，避免周期性 GATT Notify 的 INFO 日志刷屏。
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# 高度嗅探 GPIO ISR 会在 Flash cache 暂停期间运行；其 gpio_get_level 依赖必须驻留 IRAM。
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# 真机已证实被动 GPIO 嗅探会干扰 0x24；保持旧实验路径关闭。
# CONFIG_DESK_YOURDESK_HEIGHT_SNIFFER_EXPERIMENTAL is not set
CONFIG_DESK_YOURDESK_SOFT_I2C_MULTI_ADDRESS=y
# 原厂面板侧协议尚未完成可靠抓包验证；主动代理曾在旧 I2C 驱动内部触发断言。
# 在面包板复测和驱动迁移完成前关闭该实验入口，避免影响已验收的 Web/BLE 控制。
# CONFIG_DESK_YOURDESK_PANEL_PROXY is not set
CONFIG_DESK_MAX_HEIGHT_MM=1020
CONFIG_DESK_BLE_HOLD_LEASE_MS=750

# 软件多地址 Slave 已通过升降和真实高度真机验收；默认不得回退到模拟值。
# CONFIG_DESK_SIM_HEIGHT is not set
